/*沒寫完 
PS090201
 
設計一個程式，該程式會依序讀入數個學生成績，包含學號、國文、英文成績(輸入學號0表示結束，至多讀入20個學生成績)，之後找出國文及英文成績的平均（計算到小數點下兩位四捨五入）。

=== 範例執行結果(1) ===
1001 80 90 <- 輸入學號、成績
1002 70 80
1003 70 90
0
AVG=73.33 86.67

=== 範例執行結果(2) ===
2001 90 100 <- 輸入學號、成績
2002 90 90
2003 80 60
2004 75 75
2005 60 65
0
AVG=79.00 78.00
*/
#include<stdio.h>

int main(void)
{
	int n,i,j,i1,j1,end,k,k1;
	float s[20][2],a=0,b=0;
	
	for(i=0;i<20;i++)
	{
		for(j=0;j<3;j++)
		{
			scanf("%d",&s[i][j]);
			if(s[i][j]==0)
			{
				break;
			}
		}
	}
	
	
	for(i1=0;i1<i;i1++)
	{
		for(j1=0;j1<j;j1++)
		{
			a+=s[i][1];
			b+=s[i][2];
		}
	}
	printf("AVG=%f %f",a,b);
	
	return 0;
 } 
