/*沒寫完 
PS090202
 
設計一個程式，該程式會依序讀入數個學生成績，包含學號、國文、英文成績(輸入學號0表示結束，至多讀入20個學生成績)，之後再讀入及格的分數，最後找出國文及英文成績的不及格的人數。

=== 範例執行結果(1) ===
1001 80 90 <- 輸入學號、成績
1002 40 80
1003 70 90
0
60 <- 輸入及格分數
FAIL=1 0


=== 範例執行結果(2) ===
2001 90 100 <- 輸入學號、成績
2002 50 50
2003 40 55
2004 75 45
2005 60 65
0
70 <- 輸入及格分數
FAIL=3 4
*/
#include<stdio.h>

int main(void)
{
	int n,i,j,i1,j1,end,k,k1;
	float s[20][2],a=0,b=0;
	
	for(i=0;i<20;i++)
	{
		for(j=0;j<3;j++)
		{
			scanf("%d",&s[i][j]);
			if(s[i][j]==0)
			{
				break;
			}
		}
	}
	
	
	for(i1=0;i1<i;i1++)
	{
		for(j1=0;j1<3;j1++)
		{
			if(s[i][1])
		}
	}
	printf("AVG=%f %f",a,b);
	
	return 0;
 } 
